Importamos Libreria de pandas y le asignamos como alías **pd**, si no colocamos el alias, al momento de llamar la libreria debemos colocar por ejemplo **pandas**.read_csv

In [6]:
import pandas as pd

Seteamos formato de despliegue para valores decimales (flotantes) con dos dígitos decimales

In [7]:
pd.options.display.float_format = '{:,.2f}'.format

Cargamos datos a partir del archivo "Datos.csv" y colocamos como delimitador el caracter coma (,)

In [8]:
datos = pd.read_csv("Datos.csv",delimiter=',')

Mostramos los datos cargados en la variable **datos**

In [9]:
datos.head()

,C�digo,Apellidos,Nombres,G�nero,Edad,Fecha de Ingreso,Puesto,Ubicaci�n,Sueldo Base,Bonificaci�n,Total
0,1,Mazariegos,Rene,M,19,1/01/2007,Cajero,105,"2,400.00","1,000.00","3,400.00"
1,2,Ramirez,Gladys,NaN,35,1/01/2008,Personal de servicio,107,"2,300.00","1,000.00","3,300.00"
2,3,Ortiz,Silvia,F,42,1/06/2008,Gerente T,302,"3,500.00","1,000.00","4,500.00"
3,4,Alvarado,Maria,F,22,7/07/2008,Personal de servicio,107,"2,300.00","1,000.00","3,300.00"
4,5,Perez,Isabel,F,38,9/12/2008,Supervisor,205,"2,900.00","1,000.00","3,900.00"

Agregamos codificación "latin1" para despliegue de caractéres especiales

In [10]:
datos = pd.read_csv("Datos.csv",delimiter=',',encoding='latin1')

Mostramos los datos cargados en la variable **datos**, utilizando la codificación *latin1*, desplegando los caractéres especiales

In [11]:
datos.head()

,Código,Apellidos,Nombres,Género,Edad,Fecha de Ingreso,Puesto,Ubicación,Sueldo Base,Bonificación,Total
0,1,Mazariegos,Rene,M,19,1/01/2007,Cajero,105,"2,400.00","1,000.00","3,400.00"
1,2,Ramirez,Gladys,NaN,35,1/01/2008,Personal de servicio,107,"2,300.00","1,000.00","3,300.00"
2,3,Ortiz,Silvia,F,42,1/06/2008,Gerente T,302,"3,500.00","1,000.00","4,500.00"
3,4,Alvarado,Maria,F,22,7/07/2008,Personal de servicio,107,"2,300.00","1,000.00","3,300.00"
4,5,Perez,Isabel,F,38,9/12/2008,Supervisor,205,"2,900.00","1,000.00","3,900.00"

Verificamos el tipo de dato de las columnas cargadas desde el archivo CSV en la variable **datos**

In [12]:
datos.dtypes

Código                int64
Apellidos            object
Nombres              object
Género               object
Edad                  int64
Fecha de Ingreso     object
Puesto               object
Ubicación             int64
Sueldo Base         float64
Bonificación        float64
Total               float64
dtype: object

La columna "**Feca de Ingreso**" es de tipo *object* por lo que convertimos el tipo de dato a fecha (datetime) al momento de cargar la información desde el archivo CSV

In [13]:
datos = pd.read_csv("Datos.csv"
                    ,delimiter=','
                    ,encoding='latin1'
                    ,parse_dates=['Fecha de Ingreso']
                    )

Verificamos nuevamente el tipo de dato de las columnas cargadas, para validar el cambio de *object* a *datetime* de la columna "**Fecha de Ingreso**"

In [14]:
datos.dtypes

Código                       int64
Apellidos                   object
Nombres                     object
Género                      object
Edad                         int64
Fecha de Ingreso    datetime64[ns]
Puesto                      object
Ubicación                    int64
Sueldo Base                float64
Bonificación               float64
Total                      float64
dtype: object

Cargando unicamente datos de las columnas "Código", "Fecha de Ingreso", "Sueldo Base" y "Bonificación", desde el archivo CSV

In [15]:
datos = pd.read_csv("Datos.csv"
                    ,delimiter=','
                    ,encoding='latin1'
                    ,parse_dates=['Fecha de Ingreso']
                    ,usecols=['Código','Fecha de Ingreso','Sueldo Base','Bonificación']
                    )

Verificamos que se hayan cargado unicamente las columnas "Código", "Fecha de Ingreso", "Sueldo Base" y "Bonificación" a neustra variable **datos**

In [16]:
datos.head()

   Código Fecha de Ingreso  Sueldo Base  Bonificación
0       1       2007-01-01     2,400.00      1,000.00
1       2       2008-01-01     2,300.00      1,000.00
2       3       2008-01-06     3,500.00      1,000.00
3       4       2008-07-07     2,300.00      1,000.00
4       5       2008-09-12     2,900.00      1,000.00